


// Time 1 soatdan oshu ketti
// Fail



//3.Напишите программу, которая вычисляет факториал введенного пользователем числа.
// Реализуйте проверку на ввод положительного целого числа.



// 5 = 1x2x3x4x5
// 1x2=2
// 2x3=6
// 6x4=24
// 24x5=120



int factorial = 5;



int beginFrom = 1;
for (int i = 2; i <= factorial; i++)
{
    Console.WriteLine(beginFrom = beginFrom * i);
}

Console.WriteLine(beginFrom);



